# 1. Используем официальный базовый образ Python
# Выбираем slim-версию для уменьшения размера образа
FROM python:3.9-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
# Все последующие команды будут выполняться относительно этой директории
WORKDIR /app

# 3. Устанавливаем системные зависимости, включая ffmpeg
# apt-get update - обновляет список пакетов
# apt-get install -y --no-install-recommends ffmpeg - устанавливает ffmpeg
#   -y - автоматически отвечает "yes" на все запросы
#   --no-install-recommends - не устанавливает рекомендованные, но не обязательные пакеты, для уменьшения размера
# rm -rf /var/lib/apt/lists/* - очищает кэш apt после установки, чтобы уменьшить размер образа
RUN apt-get update && apt-get install -y --no-install-recommends \
    ffmpeg \
    && rm -rf /var/lib/apt/lists/*

# 4. Копируем файл зависимостей в рабочую директорию
COPY requirements.txt requirements.txt

# 5. Устанавливаем Python-зависимости
# --no-cache-dir - отключает кэширование pip, что также помогает уменьшить размер образа
RUN pip install --no-cache-dir -r requirements.txt

# 6. Копируем остальной код приложения в рабочую директорию контейнера
# Точка (.) означает текущую директорию (где находится Dockerfile)
# Вторая точка (.) означает текущую рабочую директорию внутри контейнера (/app)
COPY . .
# Если у вас есть файл youtube.com_cookies.txt и вы хотите его использовать,
# раскомментируйте следующую строку и убедитесь, что файл cookies.txt находится в корне проекта:
# COPY youtube.com_cookies.txt ./youtube.com_cookies.txt

# 7. Указываем порт, который будет слушать ваше приложение внутри контейнера
# Cloud Run (и другие платформы) автоматически передадут этот порт через переменную окружения PORT
ENV PORT 8080

# 8. Команда для запуска вашего Flask-приложения с использованием Gunicorn
# Gunicorn - это производственный WSGI HTTP сервер для UNIX.
# app:app означает: файл app.py, объект Flask с именем app внутри него.
# --bind :$PORT - Gunicorn будет слушать порт, указанный в переменной окружения PORT, на всех интерфейсах.
# --workers 1: Количество рабочих процессов Gunicorn. Для Cloud Run с 1 vCPU часто достаточно 1.
# --threads 8: Количество потоков на каждый рабочий процесс. Помогает обрабатывать несколько запросов одновременно.
# --timeout 0: Отключает тайм-аут для рабочих процессов Gunicorn.
#              Это может быть полезно для длительных операций скачивания yt-dlp.
#              Однако, сам Cloud Run имеет свой собственный тайм-аут запроса (по умолчанию 5 минут, макс. 60 мин),
#              который будет прерывать слишком долгие запросы независимо от этой настройки Gunicorn.
CMD exec gunicorn --bind :$PORT --workers 1 --threads 8 --timeout 0 app:app
