{
    "pageTitle": "thebitsamurai tərəfindən YouTube, YouTube Music, SoundCloud və digər saytlar üçün Yükləyici",
    "metaDescriptionContent": "YouTube, YouTube Music, SoundCloud və digər saytlardan videolar/treklər və pleylistlərdən musiqi və video faylları MP3, M4A, Opus və ya MP4 formatlarında asanlıqla yükləyin. thebitsamurai tərəfindən yaradılıb.",
    "navInfoButton": "Məlumat",
    "navCopyrightButton": "Müəllif Hüquqları",
    "navUpdatesButton": "Yenilikler (Bloq)",
    "navGithubButton": "GitHub",
    "infoTitle": "Bu Sayt Haqqında",
    "infoHowItWorksTitle": "Bu Sayt Necə İşləyir",
    "infoHowItWorksPara1": "Bu veb tətbiqi YouTube, YouTube Music, SoundCloud və ya digər saytlardan videolar/treklər və ya pleylistlərdən audio/video yükləməyə imkan verir. Siz sadəcə URL-ni daxil edir, istədiyiniz formatı (MP3, M4A, Opus və ya MP4) seçirsiniz və server tərəfi skripti sorğunu emal edir.",
    "infoHowItWorksPara2": "Backend məzmun məlumatlarını əldə etmək və audio/video axınını çıxarmaq üçün güclü <code>yt-dlp</code> kitabxanasından istifadə edir. MP3, M4A, Opus və ya MP4 formatı seçildikdə, çevrilmə və metadatanın daxil edilməsi üçün <code>ffmpeg</code> istifadə olunur.",
    "infoHowItWorksPara3": "Yüklənmiş fayl müvəqqəti olaraq serverdə saxlanılır və sonra brauzeriniz vasitəsilə birbaşa yükləmək üçün sizə təqdim olunur. Fayl sizə təqdim edildikdən sonra, yerə qənaət etmək və məxfiliyi təmin etmək üçün avtomatik olaraq serverdən silinir.",
    "infoLibrariesTitle": "Əsas Kitabxanalar və Texnologiyalar",
    "infoLibFlask": "<strong>Flask:</strong> Backend API qurmaq üçün istifadə olunan Python üçün mikro veb freymvorku.",
    "infoLibYtdlp": "<strong>yt-dlp:</strong> YouTube, YouTube Music, SoundCloud və bir çox başqa saytlardan video/audio yükləmək üçün əmr sətiri proqramı. Bu, əlavə funksiyalar və düzəlişlərlə youtube-dl-in bir forkudur.",
    "infoLibFFmpeg": "<strong>FFmpeg:</strong> Audio və video yazmaq, çevirmək və yayımlamaq üçün tam, çarpaz platformalı bir həll. Burada formatların çevrilməsi (MP3/M4A/Opus/MP4-ə) və metadatanın daxil edilməsi üçün istifadə olunur.",
    "infoLibTailwind": "<strong>Tailwind CSS:</strong> Xüsusi istifadəçi interfeyslərini sürətlə qurmaq üçün utilitar CSS freymvorku.",
    "infoLibJS": "<strong>JavaScript:</strong> Frontend interaktivliyi, dil dəyişdirmə, animasiyalar və backend API ilə əlaqə üçün istifadə olunur.",
    "infoPythonCodeTitle": "Python Backend Kodu",
    "infoPythonCodePara": "Əsas backend məntiqi Flask freymvorkundan istifadə edərək Python-da yazılmışdır. Python skripti (adətən <code>app.py</code> adlanır) API sorğularını idarə edir, <code>yt-dlp</code> və <code>ffmpeg</code> ilə qarşılıqlı əlaqədə olur, müvəqqəti fayl saxlanmasını idarə edir və faylları təqdim edir. Bu kod serverdə işləyir və burada birbaşa görünmür, lakin yükləyicinin funksionallığını təmin edir.",
    "copyrightTitle": "Müəllif Hüquqları və Məsuliyyət",
    "copyrightPara1": "Nəzərə alın ki, YouTube, SoundCloud və digər platformalarda mövcud olan musiqi və digər audio məzmun müəllif hüquqları ilə qoruna bilər. Bir çox sənətçi və məzmun yaradıcısının əsərləri üçün xüsusi lisenziyaları və istifadə şərtləri var. Hər hansı bir məzmunu yükləməzdən əvvəl lazımi hüquqlara və ya icazələrə sahib olduğunuzdan əmin olmaq sizin məsuliyyətinizdir.",
    "copyrightPara2": "Bu saytın tərtibatçısı bu aləti rahatlıq üçün təqdim edir və yükləməyi seçdiyiniz məzmuna və ya ondan necə istifadə etdiyinizə görə məsuliyyət daşımır. Bu xidmətdən istifadə etməklə, hərəkətlərinizə və bütün tətbiq olunan müəllif hüquqları qanunlarına və məzmun təminatçılarının xidmət şərtlərininə riayət etməyə görə yalnız sizin məsuliyyət daşıdığınızı qəbul edirsiniz.",
    "infoCreatorTitle": "Yaradıcı",
    "infoCreatorName": "Bu YouTube, YouTube Music və SoundCloud Yükləyicisi saytı <strong>thebitsamurai</strong> tərəfindən yaradılmışdır.",
    "headerH1": "Musiqi Yükləyicisi",
    "headerP": "YouTube, YouTube Music və ya SoundCloud keçidini daxil edin",
    "urlLabel": "YouTube/YouTube Music/SoundCloud keçidi:",
    "urlPlaceholder": "məsələn, https://music.youtube.com/watch?v=... və ya https://soundcloud.com/track",
    "formatLabel": "Format seçin:",
    "formatMp3": "MP3 (tövsiyə olunur)",
    "formatM4a": "M4A (Apple AAC)",
    "formatOpus": "Opus (yüksək səmərəlilik)",
    "formatMp4": "MP4 (video 720p)",
    "submitButton": "Yüklə",
    "footerCopyrightText": "YouTube, YouTube Music, SoundCloud və digər saytlar üçün musiqi yükləyicisi. Sayt thebitsamurai tərəfindən hazırlanıb.",
    "footerWatermark": "thebitsamurai tərəfindən hazırlanıb",
    "statusErrorUrl": "Zəhmət olmasa, YouTube, YouTube Music və ya SoundCloud üçün düzgün URL daxil edin.",
    "statusProcessing": "Keçid emal olunur... Zəhmət olmasa, gözləyin.",
    "statusSuccessHeader": "Hazırdır! Yükləmələr başlayır:",
    "statusDownloadLinkText": "{FORMAT} Yüklə",
    "statusPostDownloadHint": "Əgər yükləmələr başlamadısa, brauzerin pop-up parametrlərini və ya faylın yadda saxlanma yerini yoxlayın.",
    "statusErrorGeneric": "Xəta: {MESSAGE}",
    "statusNetworkError": "Şəbəkə xətası baş verdi. Zəhmət olmasa, yenidən cəhd edin.",
    "backgroundLabel": "Arka plan:",
    "backgroundNight": "Gece gökyüzü",
    "backgroundFaultyTerminal": "Arızalı Terminal",
    "backgroundDotGrid": "Nokta ızgarası",
    "backgroundAurora": "Aurora",
    "backgroundDither": "Dither",
    "languageLabel": "Dil:",
    "telegramSubscription": "İstehsalçıların Telegram kanalına abunə olun:",
    "telegramBotAlternative": "Telegram bot alternativi:",
    "fileStatusPending": "Gözlənilir...",
    "fileStatusDownloading": "Yüklənir...",
    "fileStatusStarted": "Başladı! Brauzeri yoxlayın.",
    "durationLimitInfo": "Qeyd: 10 dəqiqədən uzun məzmun yüklənə bilməz.",
    "durationLimitError": "10 dəqiqədən uzun məzmun yüklənə bilməz.",
    "playlistDurationLimitError": "Pleylistdə 10 dəqiqədən uzun məzmun var, bu yüklənə bilməz."
}