{
    "pageTitle": "Загрузчик музыки с YouTube, YouTube Music, SoundCloud и других сайтов от thebitsamurai",
    "metaDescriptionContent": "Легко скачивайте музыку и видео из видео/треков и плейлистов YouTube, YouTube Music, SoundCloud и других сайтов в форматах MP3, M4A, Opus или MP4. Создано thebitsamurai.",
    "navInfoButton": "Инфо",
    "navCopyrightButton": "Авторское право",
    "navShareButton": "Поделиться",
    "navUpdatesButton": "Обновления (Блог)",
    "navGithubButton": "GitHub",
    "shareTitle": "Поделиться Music Jacker",
    "shareDescription": "Отсканируйте QR-код или нажмите кнопку ниже, чтобы открыть Music Jacker на другом устройстве.",
    "shareCta": "Поделиться",
    "shareNativeHint": "Если системный экран «Поделиться» недоступен, мы скопируем ссылку.",
    "shareNativeTitle": "Music Jacker",
    "shareNativeText": "Скачивайте музыку и видео с YouTube, YouTube Music или SoundCloud.",
    "shareClipboardFallback": "Ссылка скопирована. Можно отправить друзьям!",
    "shareUnsupported": "Поделиться не поддерживается в этом браузере.",
    "shareFailed": "Не удалось открыть меню «Поделиться». Попробуйте снова.",
    "infoTitle": "Об этом сайте",
    "infoHowItWorksTitle": "Как работает этот сайт",
    "infoHowItWorksPara1": "Это веб-приложение позволяет загружать аудио/видео из видео/треков или плейлистов YouTube, YouTube Music, SoundCloud или других сайтов. Вы просто вставляете URL-адрес, выбираете желаемый формат (MP3, M4A, Opus или MP4), и серверный скрипт обрабатывает ваш запрос.",
    "infoHowItWorksPara2": "Бэкенд использует мощную библиотеку <code>yt-dlp</code> для получения информации о контенте и извлечения аудио/видеопотока. Если выбран формат MP3, M4A, Opus или MP4, для преобразования и встраивания метаданных используется <code>ffmpeg</code>.",
    "infoHowItWorksPara3": "Загруженный файл временно сохраняется на сервере, а затем становится доступным для прямой загрузки через ваш браузер. После того как файл передан вам, он автоматически удаляется с сервера для экономии места и обеспечения конфиденциальности.",
    "infoLibrariesTitle": "Ключевые библиотеки и технологии",
    "infoLibFlask": "<strong>Flask:</strong> Микрофреймворк для веб-разработки на Python, используемый для создания бэкенд API.",
    "infoLibYtdlp": "<strong>yt-dlp:</strong> Программа командной строки для загрузки видео/аудио с YouTube, YouTube Music, SoundCloud и многих других сайтов. Это форк youtube-dl с дополнительными функциями и исправлениями.",
    "infoLibFFmpeg": "<strong>FFmpeg:</strong> Полное кроссплатформенное решение для записи, преобразования и потоковой передачи аудио и видео. Здесь используется для конвертации форматов (в MP3/M4A/Opus/MP4) и встраивания метаданных.",
    "infoLibTailwind": "<strong>Tailwind CSS:</strong> Утилитарный CSS-фреймворк для быстрой разработки пользовательских интерфейсов.",
    "infoLibJS": "<strong>JavaScript:</strong> Используется для интерактивности фронтенда, переключения языков, анимаций и взаимодействия с бэкенд API.",
    "infoPythonCodeTitle": "Код бэкенда на Python",
    "infoPythonCodePara": "Основная логика бэкенда написана на Python с использованием фреймворка Flask. Python-скрипт (обычно с именем <code>app.py</code>) обрабатывает API-запросы, взаимодействует с <code>yt-dlp</code> и <code>ffmpeg</code>, управляет временным хранением файлов и отдает файлы. Этот код выполняется на сервере и здесь не отображается напрямую, но он обеспечивает работоспособность загрузчика.",
    "copyrightTitle": "Авторские права и ответственность",
    "copyrightPara1": "Пожалуйста, имейте в виду, что музыка и другой аудиоконтент, доступный на YouTube, SoundCloud и других платформах, может быть защищен авторским правом. Многие исполнители и создатели контента имеют особые лицензии и условия использования своих произведений. Вы несете ответственность за то, чтобы у вас были необходимые права или разрешения перед загрузкой любого контента.",
    "copyrightPara2": "Разработчик этого сайта предоставляет данный инструмент для удобства и не несет ответственности за контент, который вы решите загрузить, или за то, как вы его используете. Используя этот сервис, вы соглашаетесь с тем, что несете полную ответственность за свои действия и за соблюдение всех применимых законов об авторском праве и условий обслуживания поставщиков контента.",
    "infoCreatorTitle": "Создатель",
    "infoCreatorName": "Этот сайт для загрузки музыки с YouTube, YouTube Music и SoundCloud был создан <strong>thebitsamurai</strong>.",
    "headerH1": "Загрузчик Музыки",
    "headerP": "Вставьте ссылку на YouTube, YouTube Music или SoundCloud (видео, трек или плейлист)",
    "urlLabel": "Ссылка YouTube/YouTube Music/SoundCloud:",
    "urlPlaceholder": "например, https://music.youtube.com/watch?v=... или https://soundcloud.com/track",
    "formatLabel": "Выберите формат:",
    "formatMp3": "MP3 (рекомендуется)",
    "formatM4a": "M4A (Apple AAC)",
    "formatOpus": "Opus (высокая эффективность)",
    "formatMp4": "MP4 (видео 720p)",
    "submitButton": "Скачать",
    "footerCopyrightText": "Загрузчик музыки YouTube, YouTube Music, SoundCloud и других сайтов. Сайт сделан thebitsamurai.",
    "footerWatermark": "Разработано thebitsamurai",
    "statusErrorUrl": "Пожалуйста, введите корректную ссылку YouTube, YouTube Music или SoundCloud.",
    "statusProcessing": "Обработка ссылки... Пожалуйста, подождите.",
    "statusSuccessHeader": "Готово! Начинаю загрузку файла(ов):",
    "statusDownloadLinkText": "Скачать {FORMAT}",
    "statusPostDownloadHint": "Если загрузка не началась, проверьте настройки блокировки всплывающих окон или место сохранения файлов.",
    "statusErrorGeneric": "Ошибка: {MESSAGE}",
    "statusNetworkError": "Произошла сетевая ошибка. Пожалуйста, попробуйте еще раз.",
    "backgroundLabel": "Фон:",
    "backgroundNight": "Ночное небо",
    "backgroundFaultyTerminal": "Faulty Terminal",
    "backgroundDotGrid": "Сетка точек",
    "backgroundAurora": "Аврора",
    "backgroundDither": "Dither",
    "languageLabel": "Язык:",
    "telegramSubscription": "Подпишитесь на Telegram канал разработчиков:",
    "telegramBotAlternative": "Альтернативный Telegram-бот:",
    "fileStatusPending": "В ожидании...",
    "fileStatusDownloading": "Загрузка...",
    "fileStatusStarted": "Начато! Проверьте браузер.",
    "durationLimitInfo": "Примечание: Контент длиннее 10 минут не может быть скачан.",
    "durationLimitError": "Контент длиннее 10 минут не может быть скачан.",
    "playlistDurationLimitError": "Плейлист содержит контент длиннее 10 минут, который не может быть скачан."
}
