{
    "pageTitle": "thebitsamurai'dan YouTube, YouTube Music, SoundCloud ve Diğer Siteler İçin İndirici",
    "metaDescriptionContent": "YouTube, YouTube Music, SoundCloud ve diğer sitelerden videolar/şarkılar ve çalma listelerinden MP3, M4A, Opus veya MP4 formatında kolayca müzik ve video indirin. thebitsamurai tarafından oluşturuldu.",
    "navInfoButton": "Bilgi",
    "navCopyrightButton": "Telif Hakkı",
    "navShareButton": "Paylaş",
    "navUpdatesButton": "Güncellemeler (Blog)",
    "navGithubButton": "GitHub",
    "shareTitle": "Music Jacker'ı Paylaş",
    "shareDescription": "QR kodunu tara veya aşağıdaki düğmeyle Music Jacker'ı başka bir cihazda aç.",
    "shareCta": "Paylaş",
    "shareNativeHint": "Yerleşik paylaşım yoksa bağlantıyı sizin için kopyalayacağız.",
    "shareNativeTitle": "Music Jacker",
    "shareNativeText": "YouTube, YouTube Music veya SoundCloud'dan müzik ve video indir.",
    "shareClipboardFallback": "Bağlantı panoya kopyalandı. Arkadaşlarınla paylaş!",
    "shareUnsupported": "Bu tarayıcıda paylaşım desteklenmiyor.",
    "shareFailed": "Paylaşım ekranı açılamadı. Tekrar dene.",
    "infoTitle": "Bu Site Hakkında",
    "infoHowItWorksTitle": "Bu Site Nasıl Çalışır?",
    "infoHowItWorksPara1": "Bu web uygulaması, YouTube, YouTube Music, SoundCloud veya diğer sitelerden videolar/şarkılar veya oynatma listelerinden ses/video indirmenizi sağlar. URL'yi yapıştırır, istediğiniz formatı (MP3, M4A, Opus veya MP4) seçersiniz ve sunucu tarafı betiği isteğinizi işler.",
    "infoHowItWorksPara2": "Arka uç, içerik bilgilerini almak ve ses/video akışını çıkarmak için güçlü <code>yt-dlp</code> kitaplığını kullanır. MP3, M4A, Opus veya MP4 formatı seçilirse, dönüştürme ve meta veri gömme için <code>ffmpeg</code> kullanılır.",
    "infoHowItWorksPara3": "İndirilen dosya geçici olarak sunucuda saklanır ve ardından tarayıcınız üzerinden doğrudan indirmeniz için kullanıma sunulur. İndirme size sunulduktan sonra, yerden tasarruf etmek ve gizliliği sağlamak için dosya sunucudan otomatik olarak silinir.",
    "infoLibrariesTitle": "Kullanılan Temel Kitaplıklar ve Teknolojiler",
    "infoLibFlask": "<strong>Flask:</strong> Arka uç API'sini oluşturmak için Python için bir mikro web çerçevesi.",
    "infoLibYtdlp": "<strong>yt-dlp:</strong> YouTube, YouTube Music, SoundCloud ve birçok diğer siteden video/ses indirmek için komut satırı programı. youtube-dl'nin ek özellikler ve düzeltmeler içeren bir forkudur.",
    "infoLibFFmpeg": "<strong>FFmpeg:</strong> Ses ve videoyu kaydetmek, dönüştürmek ve yayınlamak için eksiksiz, çok platformlu bir çözümdür. Burada format dönüşümü (MP3/M4A/Opus/MP4) ve meta veri gömme için kullanılır.",
    "infoLibTailwind": "<strong>Tailwind CSS:</strong> A utility-first CSS framework for rapidly building custom user interfaces.",
    "infoLibJS": "<strong>JavaScript:</strong> Ön uç etkileşimi, dil değiştirme, animasyonlar ve arka uç API ile iletişim için kullanılır.",
    "infoPythonCodeTitle": "Python Arka Uç Kodu",
    "infoPythonCodePara": "Temel arka uç mantığı, Flask çerçevesi kullanılarak Python ile yazılmıştır. Python betiği (genellikle <code>app.py</code> olarak adlandırılır) API isteklerini işler, <code>yt-dlp</code> и <code>ffmpeg</code> ile etkileşime girer, geçici dosya depolamasını yönetir и dosyaları sunar. Bu kod sunucuda çalışır и здесь doğrudan görünmez, однако indiricinin işlevselliğini sağlar.",
    "copyrightTitle": "Telif Hakkı и Sorumluluk",
    "copyrightPara1": "Lütfen YouTube, SoundCloud и diğer platformlarda bulunan müzik и diğer ses içeriklerinin telif hakkıyla korunuyor olabileceğini unutmayın. Birçok sanatçı и içerik oluşturucunun eserleri için özel lisansları и kullanım koşulları vardır. Herhangi bir içeriği indirmeden önce gerekli haklara veya izinlere sahip olduğunuzdan emin olmak sizin sorumluluğunuzdadır.",
    "copyrightPara2": "Bu sitenin geliştiricisi, bu aracı kolaylık sağlamak amacıyla sunar и indirmeyi seçtiğiniz içerikten veya onu nasıl kullandığınızdan sorumlu değildir. Bu hizmeti kullanarak, eylemlerinizden и geçerli tüm telif hakkı yasalarına и içerik sağlayıcıların hizmet şartlarına uymaktan yalnızca sizin sorumluluğunuzdadır.",
    "infoCreatorTitle": "Oluşturan",
    "infoCreatorName": "Bu YouTube, YouTube Music ve SoundCloud İndirici sitesi <strong>thebitsamurai</strong> tarafından oluşturulmuştur.",
    "headerH1": "Music Jacker",
    "headerP": "YouTube, YouTube Music veya SoundCloud bağlantısı yapıştırın",
    "urlLabel": "YouTube/YouTube Music/SoundCloud bağlantısı:",
    "urlPlaceholder": "örneğin, https://music.youtube.com/watch?v=... veya https://soundcloud.com/track",
    "formatLabel": "Format seçin:",
    "formatMp3": "MP3 (önerilir)",
    "formatM4a": "M4A (Apple AAC)",
    "formatOpus": "Opus (yüksek verimlilik)",
    "formatMp4": "MP4 (video 720p)",
    "submitButton": "İndir",
    "footerCopyrightText": "YouTube, YouTube Music, SoundCloud ve Diğer İndirici. Site thebitsamurai tarafından yapıldı.",
    "footerWatermark": "thebitsamurai tarafından geliştirildi",
    "statusErrorUrl": "Lütfen geçerli bir YouTube, YouTube Music veya SoundCloud URL'si girin.",
    "statusProcessing": "Bağlantı işleniyor... Lütfen bekleyin.",
    "statusSuccessHeader": "Tamamlandı! İndirmeler başlatılıyor:",
    "statusDownloadLinkText": "{FORMAT} İndir",
    "statusPostDownloadHint": "İndirmeler başlamadıysa, tarayıcının pop-up ayarlarını veya dosya kaydetme konumunu kontrol edin.",
    "statusErrorGeneric": "Hata: {MESSAGE}",
    "statusNetworkError": "Bir ağ hatası oluştu. Lütfen tekrar deneyin.",
    "languageLabel": "Dil:",
    "telegramSubscription": "Geliştiricilerin Telegram Kanalına Abone Olun:",
    "telegramBotAlternative": "Telegram bot alternatifi:",
    "fileStatusPending": "Beklemede...",
    "fileStatusDownloading": "İndiriliyor...",
    "fileStatusStarted": "Başladı! Tarayıcıyı kontrol et.",
    "durationLimitInfo": "Not: 10 dakikadan uzun içerik indirilemez.",
    "durationLimitError": "10 dakikadan uzun içerik indirilemez.",
    "playlistDurationLimitError": "Çalma listesi 10 dakikadan uzun içerik barındırıyor, indirilemez."
}
